package com.green.day01.ch02;

public class UseVariable {
    public static void main(String[] args) {
        //변수
        int num; //변수 선언, 더 정확하게 표현하면 : 정수형의 num 1이라는 변

        //num1 변수명 (사용할 때 쓰는 이름)

        //데이터를 주입 할 때는 대입 연산자를 사용한다.




        /*
        여러군데에서 사용을 할 때 참조할 수 있도록 한다.
        왜냐, 값이 변결되었을 때 변수값만 수정을 하면 모두 변경이 되기 때문이다.

        궁극적인 이유는 데이터 저장을 목적으로 한다.

        변수를 사용하기 위해서는 선언을 해야한다.

        선언을 찰 때 데이터 타입을 명시하는데
        해당 데이터 타입만 저장이 될 수 있도록 한다. (다른 타입의 데이터는 저장 불가, 타입언어의 특징, 신뢰)
         */
    }
}
